app/controllers/book_controller.rb

SELECT "subjects".* FROM "subjects"
---
    def new
        @book = Book.new
        @subjects = Subject.all

INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Complete Reference Java"], ["price", 500.0], ["subject_id", 1], ["description", "This is the test description for Java book."], ["created_at", "2019-07-01 10:28:07.957213"]]
---
    def create
        @book = Book.new(book_params)

        if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"
---
    def edit
        @book = Book.find(params[:id])
        @subjects = Subject.all

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def delete
        Book.find(params[:id]).destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show_subjects
        @subjects = Subject.find(params[:id])